// LAB_1_31.cpp

// Лабораторная работа №1

/*
Формула F выражается так:

	F = (2*(1 - pi) / (b^2 + l^2 - 1)) + ((2 * pi) / (b^2 + l^2 - 1)) * tg (3 * a);

			 2*(1 - pi)			     2 * pi
	F =   ----------------   +   ----------------   *  tg (3 * a);
			b^2 + l^2 - 1		   b^2 + l^2 - 1
*/

// Подключение директивы препроцессора для математических решений
#define _USE_MATH_DEFINES

// Подключение библиотеки математических функций
#include <stdio.h>
#include <math.h>
#include <process.h>
// Для русификации setlocale и не только это
#include <iostream>

// Основная программа
void lab_01()
{
	// Подключение русификации программы
	setlocale(LC_ALL, "Russian");

	// Устанавливаем типы переменных
	char sw;

	// По умолчанию n = 10
	int n = 10;
	int a, b, i, sw_4_9;

	float l, F;

	// Устанавливаем точку возврата меню с потерей результата
MENU:;

	// Очистика предыдующих результатов
	system("CLS");

	// Вывод меню
	printf("1. Решение задачи по варианту, п.4.8\n");
	printf("2. Разработать программу с дополнительными требованиями, п 4.9\n");
	printf("e. Выход ...\n");

	printf("Выберете пункт меню: ");

	sw = getchar();
	//scanf_s("%c", &sw);

	printf("\n");

	//Начало

	// Переключатель
	switch (sw)
	{

	case '1':
	{
		printf("1. Решение задачи по варианту, п.4.8\n");
		printf("Введите любые числа для аргумента: a, b, l \n");

		printf("a = ");
		scanf_s("%d", &a);
		printf("b = ");
		scanf_s("%d", &b);
		printf("l = ");
		scanf_s("%f", &l);

		//Проверка на случай, если знаменатель (b^2 + l^2 - 1 = 0) равен нулю
		if (pow(b, 2) + pow(l, 2) - 1 == 0)
		{
			printf("Знаменатель 'b^2 + l^2 - 1' равен нулю. Возврат в меню\n");
		}
		else
		{
			F = ((2 * (1 - M_PI)) / (pow(b, 2) + powl(l, 2) - 1)) + ((2 * M_PI) / (pow(b, 2) + powl(l, 2) - 1)) * tan(3 * a);
			printf("F = %f для a = %d	b = %d	l = %f\n", F, a, b, l);
		}

		// Сброс буферизации при нажатии ENTER
		sw = getchar();

		system("pause");
		goto MENU;
		break;
	}

	case '2':
	{
		printf("2.Разработать программу с дополнительными требованиями, п 4.9\n");
		printf("Введите любые числа для аргумента: a, b, l \n");

		printf("a = ");
		scanf_s("%d", &a);
		printf("b = ");
		scanf_s("%d", &b);
		printf("l = ");
		scanf_s("%f", &l);

		//Проверка на случай, если знаменатель (b^2 + l^2 - 1 = 0) равен нулю
		if (pow(b, 2) + pow(l, 2) - 1 == 0)
		{
			printf("Знаменатель 'b^2 + l^2 - 1' равен нулю. Возврат в меню \n");
		}
		else
		{
			// Сброс буферизации при нажатии ENTER
			//sw = getchar();

			printf("**************************************\n");
			printf("*  №  *    F   *  a  *  b  *    l    *\n");
			printf("**************************************\n");

			printf("Выберите любое значение для аргумента n \n n = ");
			scanf_s("%d", &n);

			printf("\n");
			printf("**************************************************************\n");

			for (int i = 0; i < n; i++)
			{
				F = ((2 * (1 - M_PI)) / (pow(b, 2) + powl(l, 2) - 1)) + ((2 * M_PI) / (pow(b, 2) + powl(l, 2) - 1)) * tan(3 * a);
				printf("\n %6.2d. F = %3.5f для a = %d  b = %d   l = %5.2f \n", i + 1, F, a, b, l);

				l += (float)0.5f * M_PI;
			}

			printf("\n**************************************************************\n");
		}

		// Сброс буферизации при нажатии ENTER
		sw_4_9 = getchar();
		sw = getchar();

		system("pause");

		goto MENU;
		break;
	}

	case 'e':
	{
		printf("Выход с программы\n");

		// После этого пункта выход из программы
		exit(0);
	}

	default:
	{
		printf("Данный символ не опознан. Возврат в меню\n");

		// Сброс буферизации при нажатии ENTER
		sw = getchar();

		system("pause");
		goto MENU;
		break;
	}
	}

	system("PAUSE");
}
